from langchain_core.runnables import RunnableLambda, RunnableParallel

runnable1 = RunnableLambda(lambda x: {"foo": x})
runnable2 = RunnableLambda(lambda x: [x] * 2)

##################################################################################
### 1. 입력값에 따라 동적으로 체인을 구성
### 입력값이 6보다 크면 runnable1 실행, 아니면 runnable2 실행
print('1.', '-' * 50)
##################################################################################
chain = RunnableLambda(lambda x: runnable1 if x > 6 else runnable2)

print(chain.invoke(7))
# 1. --------------------------------------------------
# {'foo': 7}

##################################################################################
### 2. 입력값이 6보다 작은 경우
print('2.', '-' * 50)
##################################################################################
print(chain.invoke(5))
# 2. --------------------------------------------------
# [5, 5]